app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page])
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hoang duy"], ["email", "hoang@gmail.com"], ["created_at", "2017-09-26 10:15:55.694392"], ["updated_at", "2017-09-26 10:15:55.694392"]]